Repository: ntgptit/lumos
Catalog: lib/l10n/app_*.arb
Languages: vi

# commonCancel
source: Cancel
vi: Hủy

# commonCreate
source: Create
vi: Tạo

# commonSave
source: Save
vi: Lưu

# commonDelete
source: Delete
vi: Xóa

# commonRetry
source: Retry
vi: Thử lại

# commonRename
source: Rename
vi: Đổi tên

# folderNewFolder
source: New Folder
vi: Thư mục mới

# folderCreateTitle
source: Create folder
vi: Tạo thư mục

# folderRenameTitle
source: Rename folder
vi: Đổi tên thư mục

# folderDeleteTitle
source: Delete folder
vi: Xóa thư mục

# folderNameLabel
source: Folder name
vi: Tên thư mục

# folderManagerTitle
source: Folder Manager
vi: Quản lý thư mục

# folderManagerSubtitle
source: Browse tree, create, rename, and soft-delete folders.
vi: Duyệt cây thư mục, tạo, đổi tên và xóa mềm thư mục.

# folderRoot
source: Root
vi: Gốc

# folderEmptyTitle
source: No folders here yet.
vi: Chưa có thư mục nào.

# folderEmptySubtitle
source: Create one to start organizing content.
vi: Hãy tạo một thư mục để bắt đầu sắp xếp nội dung.

# folderDeleteConfirm
source: Delete "{name}" and all subfolders?
vi: Xóa "{name}" và toàn bộ thư mục con?

# folderDepth
source: Depth {depth}
vi: Độ sâu {depth}

# homeGreeting
source: Good evening, Learner
vi: Chào buổi tối, người học

# homeGoalProgress
source: You are 78% closer to your weekly goal.
vi: Bạn đã hoàn thành 78% mục tiêu tuần này.

# homeHeroTitle
source: Build fluency with momentum
vi: Xây dựng độ trôi chảy với đà tiến bộ

# homeHeroBody
source: Daily sessions, focused practice, and visual progress in one modern workspace.
vi: Các phiên học hằng ngày, luyện tập tập trung và theo dõi tiến độ trực quan trong một không gian hiện đại.

# homeAiLearningPath
source: AI Learning Path
vi: Lộ trình học bằng AI

# homePrimaryAction
source: Start Session
vi: Bắt đầu phiên học

# homeSecondaryAction
source: Review Deck
vi: Ôn bộ thẻ

# homeStreakLabel
source: Streak
vi: Chuỗi ngày

# homeAccuracyLabel
source: Accuracy
vi: Độ chính xác

# homeXpLabel
source: Weekly XP
vi: XP tuần

# homeStatStreakValue
source: 12 days
vi: 12 ngày

# homeFocusTitle
source: Today's Focus
vi: Trọng tâm hôm nay

# homeTaskShadowListeningTitle
source: Shadow listening - 15 min
vi: Nghe nhại - 15 phút

# homeTaskVocabularyTitle
source: Vocabulary sprint - 20 words
vi: Tăng tốc từ vựng - 20 từ

# homeTaskPronunciationTitle
source: Pronunciation drill - 10 min
vi: Luyện phát âm - 10 phút

# homeActivityTitle
source: Recent Activity
vi: Hoạt động gần đây

# homeActivitySpanishTitle
source: Spanish Travel Pack
vi: Gói du lịch tiếng Tây Ban Nha

# homeActivitySpanishSubtitle
source: Completed 18 cards
vi: Hoàn thành 18 thẻ

# homeActivityGrammarTitle
source: Grammar: Present Perfect
vi: Ngữ pháp: Hiện tại hoàn thành

# homeActivityGrammarSubtitle
source: Scored 9/10
vi: Đạt 9/10

# homeActivitySpeakingTitle
source: Speaking Challenge
vi: Thử thách nói

# homeActivitySpeakingSubtitle
source: New best streak: 5
vi: Chuỗi tốt nhất mới: 5

# homeActivitySpeakingTrailing
source: Badge
vi: Huy hiệu

# homeTabHome
source: Home
vi: Trang chủ

# homeTabLibrary
source: Library
vi: Thư viện

# homeTabFolders
source: Folders
vi: Thư mục

# homeTabProgress
source: Progress
vi: Tiến độ

# homeTabProfile
source: Profile
vi: Hồ sơ

# homeLibrarySubtitle
source: Your decks, lessons, and curated packs.
vi: Bộ thẻ, bài học và gói học đã tuyển chọn của bạn.

# homeProgressSubtitle
source: Track streaks, XP trends, and weak skills.
vi: Theo dõi chuỗi ngày, xu hướng XP và kỹ năng còn yếu.

# homeProfileSubtitle
source: Manage your goals and learning preferences.
vi: Quản lý mục tiêu và tùy chọn học tập của bạn.
